In [6]:
import numpy as np
import pandas as pd

In [8]:
#creating series with array
arr1 = np.array([10,20,30,40,50])

In [10]:
ser1 =pd.Series(arr1)

In [12]:
ser1   # by default indexing starts with zero

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [14]:
ser1=pd.Series([12.3,14.5,54.5,27.9])

In [16]:
ser1

0    12.3
1    14.5
2    54.5
3    27.9
dtype: float64

In [18]:
ser1 =pd.Series([12.4,15.5,'a'])
ser1

0    12.4
1    15.5
2       a
dtype: object

In [20]:
# list to ser1
lis1=[45,24,23,67]
ser2=pd.Series(lis1,index=['A','B','C','D']) # we can  customize index it helps with searching easily

ser2

A    45
B    24
C    23
D    67
dtype: int64

In [22]:
list1 =[23,4,55,5]
list2=['A','B','C','D']

In [24]:
ser3=pd.Series(list1,index=['A','B','C','D'])

In [26]:
ser3

A    23
B     4
C    55
D     5
dtype: int64

In [28]:
ser2.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [30]:
type(ser2.index)

pandas.core.indexes.base.Index

In [32]:
ser2.values

array([45, 24, 23, 67], dtype=int64)

In [34]:
type(ser2.values)

numpy.ndarray

In [36]:
mydict ={'papa':'a','mother':'b','Daughter':'c','son':'d'}

In [38]:
mydict

{'papa': 'a', 'mother': 'b', 'Daughter': 'c', 'son': 'd'}

In [40]:
ser4=pd.Series(mydict)

In [42]:
ser4

papa        a
mother      b
Daughter    c
son         d
dtype: object

In [44]:
# no of indexs = no of values

In [46]:
# DATA FRAME

In [48]:
# df= pd.DataFrame([['Sudeep',47,'BLr'],['vinay',35,'MUM'],['Bhaskar',40,'Dli'],['Kavita',27,'CHN']])
# each list will become row  columns are optinal bydefault it will be 0,1,2
df= pd.DataFrame([['Sudeep',47,'BLr'],['vinay',35,'MUM'],['Bhaskar',40,'Dli'],['Kavita',27,'CHN']],columns=['Name','Age','Location'])
df

      Name  Age Location
0   Sudeep   47      BLr
1    vinay   35      MUM
2  Bhaskar   40      Dli
3   Kavita   27      CHN

In [198]:
dicpl= {'Name':['Sachin','Virat','Dhoni','Shewag'], 'Score':[34,23,56,63],'Team':['MI','RCB','CSK','DD']}

In [200]:
dicpl

{'Name': ['Sachin', 'Virat', 'Dhoni', 'Shewag'],
 'Score': [34, 23, 56, 63],
 'Team': ['MI', 'RCB', 'CSK', 'DD']}

In [202]:
ser5=pd.Series(dicpl)

In [204]:
ser5

Name     [Sachin, Virat, Dhoni, Shewag]
Score                  [34, 23, 56, 63]
Team                 [MI, RCB, CSK, DD]
dtype: object

In [206]:
pl_df=pd.DataFrame(dicpl)

In [208]:
pl_df

     Name  Score Team
0  Sachin     34   MI
1   Virat     23  RCB
2   Dhoni     56  CSK
3  Shewag     63   DD

In [210]:
# to add new row to df1 create new df2- name of cloumns same as df1 
new_df = pd.DataFrame([['Smith',30,'CSK'],['Rohit',30,'MI']],columns=pl_df.columns)
new_df

    Name  Score Team
0  Smith     30  CSK
1  Rohit     30   MI

In [212]:
# change index .reset_index(drop=True)
mydf=pd.concat([pl_df,new_df]).reset_index(drop=True)
mydf

     Name  Score Team
0  Sachin     34   MI
1   Virat     23  RCB
2   Dhoni     56  CSK
3  Shewag     63   DD
4   Smith     30  CSK
5   Rohit     30   MI

In [214]:
# Adding a Column
Age=[50,37,40,42,36,38]

In [216]:
mydf['Age']=Age

In [218]:
mydf

     Name  Score Team  Age
0  Sachin     34   MI   50
1   Virat     23  RCB   37
2   Dhoni     56  CSK   40
3  Shewag     63   DD   42
4   Smith     30  CSK   36
5   Rohit     30   MI   38

In [220]:
mydf.head()

     Name  Score Team  Age
0  Sachin     34   MI   50
1   Virat     23  RCB   37
2   Dhoni     56  CSK   40
3  Shewag     63   DD   42
4   Smith     30  CSK   36

In [224]:
mydf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Score   6 non-null      int64
 2   Team    6 non-null      object
 3   Age     6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [226]:
mydf.describe()

           Score        Age
count   6.000000   6.000000
mean   39.333333  40.500000
std    16.169931   5.128353
min    23.000000  36.000000
25%    30.000000  37.250000
50%    32.000000  39.000000
75%    50.500000  41.500000
max    63.000000  50.000000

In [228]:
mydf['Name']

0    Sachin
1     Virat
2     Dhoni
3    Shewag
4     Smith
5     Rohit
Name: Name, dtype: object

In [230]:
mydf[['Score','Team']]

   Score Team
0     34   MI
1     23  RCB
2     56  CSK
3     63   DD
4     30  CSK
5     30   MI

In [232]:
mydf

     Name  Score Team  Age
0  Sachin     34   MI   50
1   Virat     23  RCB   37
2   Dhoni     56  CSK   40
3  Shewag     63   DD   42
4   Smith     30  CSK   36
5   Rohit     30   MI   38

MODIFYING  Row values

In [235]:
mydf.at[3,'Team']='KKIP'  # at row,column

mydf

In [238]:
mydf.iat[2,3]  # getting data using index only

40

OPERATIONS ON ROW

In [241]:
mydf.iloc[[1,3,5]]  # iloc for index,location   give location acccording to index

     Name  Score  Team  Age
1   Virat     23   RCB   37
3  Shewag     63  KKIP   42
5   Rohit     30    MI   38

In [243]:
mydf.iloc[:,1]

0    34
1    23
2    56
3    63
4    30
5    30
Name: Score, dtype: int64

In [245]:
mydf.iloc[:,[1,2]]

   Score  Team
0     34    MI
1     23   RCB
2     56   CSK
3     63  KKIP
4     30   CSK
5     30    MI

In [247]:
mydf[['Score','Team']]

   Score  Team
0     34    MI
1     23   RCB
2     56   CSK
3     63  KKIP
4     30   CSK
5     30    MI

In [249]:
mydf.Score

0    34
1    23
2    56
3    63
4    30
5    30
Name: Score, dtype: int64

In [253]:
mydf.drop([3,4],axis=0)

     Name  Score Team  Age
0  Sachin     34   MI   50
1   Virat     23  RCB   37
2   Dhoni     56  CSK   40
5   Rohit     30   MI   38

In [257]:
#deletion of row

temp=mydf.drop([3,4],axis=0)
temp

     Name  Score Team  Age
0  Sachin     34   MI   50
1   Virat     23  RCB   37
2   Dhoni     56  CSK   40
5   Rohit     30   MI   38

In [259]:
temp.iloc[3]

Name     Rohit
Score       30
Team        MI
Age         38
Name: 5, dtype: object

In [261]:
temp=mydf.drop([3,4],axis=0).reset_index(drop=True)
temp

     Name  Score Team  Age
0  Sachin     34   MI   50
1   Virat     23  RCB   37
2   Dhoni     56  CSK   40
3   Rohit     30   MI   38

In [263]:
temp.iloc[:1]

     Name  Score Team  Age
0  Sachin     34   MI   50

In [265]:
x1=list(temp.columns)

In [267]:
x1

['Name', 'Score', 'Team', 'Age']

In [269]:
x1[1]='Runs'

In [271]:
x1

['Name', 'Runs', 'Team', 'Age']

In [273]:
temp.columns=x1

In [275]:
temp

     Name  Runs Team  Age
0  Sachin    34   MI   50
1   Virat    23  RCB   37
2   Dhoni    56  CSK   40
3   Rohit    30   MI   38

In [277]:
mydf.describe()

           Score        Age
count   6.000000   6.000000
mean   39.333333  40.500000
std    16.169931   5.128353
min    23.000000  36.000000
25%    30.000000  37.250000
50%    32.000000  39.000000
75%    50.500000  41.500000
max    63.000000  50.000000

In [283]:
# mydf.insert(2, "PER", (mydf.Score*0.10)+5)
# mydf['PER'] = (mydf['Score'] * 0.10) + 5
mydf

     Name  Score  Team  Age   PER
0  Sachin     34    MI   50   8.4
1   Virat     23   RCB   37   7.3
2   Dhoni     56   CSK   40  10.6
3  Shewag     63  KKIP   42  11.3
4   Smith     30   CSK   36   8.0
5   Rohit     30    MI   38   8.0